Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རིན་པོ་ཆེ་འདི་བདུན་གྱིས་ཤིན་ཏུ་བཟང་ཞིང་བལྟ་ན་མཛེས་པ། རིན་པོ་ཆེའི་འོབས་ཟབས་སུ་ཟབ་པ། ཆུས་གང་བ་གཞི་གསེར་གྱི་གྲམ་པས་གང་བ། ལྷ་རྫས་ཀྱི་ཨུཏྤ་ལ་དང་། པདྨོ་དང་། ཀུ་མུད་དང་།
en: It was encircled by seven wonderful and beautiful moats that were trenches of the seven precious materials—gold, silver, beryl, crystal, red pearls, emeralds, and white coral—filled with water, with a layer of gold sand at their bottoms, their surfaces covered with divine blue lotuses, red lotuses, night lotuses, and white lotuses and the water made turbid with yellow sandalwood mud.

source: བུནྡ་རི་ཀས་ཀུན་ནས་ཡོག་པ། དུས་དང་འཐུན་པའི་ཙན་དན་གྱི་འདམ་དང་། ལུ་མས་འཁོར་བ་བདུན་གྱིས་ཀུན་ནས་ཡོངས་སུ་བསྐོར་བ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཏ་ལའི་ཕྲེང་བ་རིམ་པ་བདུན་གྱིས་ཀུན་ནས་ཡོངས་སུ་བསྐོར་བ། རྡོ་རྗེ་རིན་པོ་ཆེའི་ར་བ་བདུན་གྱིས་ཀུན་ནས་ཡོངས་སུ་བསྐོར་བ། འདི་ལྟ་སྟེ། སེང་གེ་ཡིད་དུ་འོང་བའི་རྡོ་རྗེའི་ར་བ་དང་། རྡོ་རྗེ་གཞན་གྱིས་ཐུབ་པ་མེད་པའི་ར་བ་དང་།
en: It was encircled by seven rows of palm trees made of the seven precious materials.

source: འབུག་པའི་ངང་ཚུལ་གྱི་རྡོ་རྗེའི་ར་བ་དང་། ཐུབ་པར་དཀའ་བའི་ངང་ཚུལ་གྱི་རྡོ་རྗེའི་ར་བ་དང་། རྡོ་རྗེ་བརྟན་པ་ཆགས་པ་མེད་པའི་ར་བ་དང་། རྡོ་རྗེའི་འོད་གཟེར་དྲ་བའི་སྙིང་པོའི་ར་བ་དང་། རྡུལ་དང་བྲལ་བའི་ཁ་དོག་གི་རྒྱན་གྱི་རྡོ་རྗེའི་ར་བས་ཡོངས་སུ་བསྐོར་བ་སྟེ།
en: It was encircled by seven walls made of diamonds: these were a wall of lovely lion diamonds, a wall of undefeatable diamonds, a wall of powerfully penetrative diamonds, a wall of invincible diamonds, a strong wall of unimpedable, resolute diamonds, a wall that contained a network of the light rays of diamonds, and a wall of the array of the immaculate colors of diamonds.

source: རྡོ་རྗེ་རིན་པོ་ཆེའི་ར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་། ནོར་བུ་རིན་པོ་ཆེ་གྲངས་མེད་པས་ཡོངས་སུ་སྤྲས་པ།
en: All those great walls of precious diamonds were studded with countless precious jewels.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ལན་ཀན་དང་། བ་སོ་མཛེས་པར་བཀྱེ་བ་དངུལ་རིན་པོ་ཆེའི་བ་སོ་ཕྲེང་བ་མཛེས་པས་བརྒྱན་པ། རིན་པོ་བཻཌཱུཪྻའི་བ་སོའི་ཕྲེང་བ་མཛེས་པས་བརྒྱན་པ། རིན་པོ་ཆེ་ཤེལ་གྱི་བ་སོའི་ཕྲེང་བ་མཛེས་པས་བརྒྱན་པ། རིན་པོ་ཆེ་བྱི་རུའི་བ་སོའི་ཕྲེང་བ་མཛེས་པས་བརྒྱན་པ།
en: They were adorned with shining railings of Jambu River gold on which were strung strings of ivory beads, shining railings of silver jewels on which were strung strings of ivory beads, shining railings of beryl jewels on which were strung strings of ivory beads, shining railings of crystal jewels on which were strung strings of ivory beads, shining railings of coral jewels on which were strung strings of ivory beads, shining railings of red pearls on which were strung strings of ivory beads, and shining railings of pearl jewels, the essence of the oceans, on which were strung strings of ivory beads.

source: མུ་ཏིག་དམར་པོའི་བ་སོའི་ཕྲེང་བ་མཛེས་པས་བརྒྱན་པ། མུ་ཏིག་རིན་པོ་ཆེ་རྒྱ་མཚོའི་སྙིང་པོའི་བ་སོའི་ཕྲེང་བ་མཛེས་པས་བརྒྱན་པ་སྟེ། གྲོང་ཁྱེར་ཆེན་པོ་དེའི་སྒོ་ཆེན་པོ་བརྒྱད་ཀྱི་བར་བར་ན་ཡང་དཔག་ཚད་བཅུ་བཅུ་ཡོད་དོ། །
en: The distance between each of the eight great gateways of the city was ten yojanas.

source: སྒོ་དེ་དག་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་སྣ་ཚོགས་མཛེས་པར་བྱས་པ་སྟེ། བལྟ་ན་ཡིད་དུ་འོང་བའོ། །
en: The gates were multicolored, beautifully made of the seven precious materials.

source: གྲོང་ཁྱེར་ཆེན་པོ་དེ་ནི་དེ་ལྟར་རྒྱ་ཆེ་ཞིང་ཡངས་ལ་ཡན་ལག་རྣམ་པར་བརྒྱད་དུ་རྣམ་པར་ཕྱེ་བ།
en: That great city was vast, huge, and divided into eight districts.

source: བཻཌཱུརྱ་སྔོན་པོའི་ས་ལ་གནས་པ་སྟེ།
en: The ground was made of blue beryl.

source: གྲོང་ཁྱེར་ཆེན་པོ་དེའི་ནང་ན་ཡང་སྲང་ཆེན་པོ་བྱེ་བ་ཕྲག་བཅུ་ཡོད་དེ། སྲང་རེ་རེའི་གློ་གཉིས་ནས་ཀྱང་ཁྱིམ་ཆེན་པོ་བརྒྱ་ཕྲག་སྟོང་སྟོང་མཁོས་ལེགས་པར་འགྲིགས་པ་སྟེ། ཀུན་ཀྱང་རིན་པོ་ཆེ་སྣ་ཚོགས་ལས་བྱས་པ་དག་གོ །
en: There were a hundred million streets in that city, and on both sides of each street there were a hundred thousand well-built and arranged mansions in which many hundreds of billions of beings lived.

source: རིན་པོ་ཆེའི་རྒྱན་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པ་དག་གོ རིན་པོ་ཆེའི་གདུགས་དང་རྒྱལ་མཚན་བསྒྲེང་བ་དང་།
en: All those houses were made of the seven precious materials, were adorned with an array of various jewels, had precious parasols and banners erected upon them, and were endowed with all requisites.

source: བ་དན་ཆེ་ཕྲ་དང་ལྡན་པ་དག་གོ །ཡོ་བྱད་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པ་དག་གོ ། སེམས་ཅན་ཁྲག་ཁྲིག་དུ་མ་གནས་པ་དག་གོ །གྲོང་ཁྱེར་ཆེན་པོ་དེ་ཡང་ནོར་བུ་རིན་པོ་ཆེའི་ཁ་དོག་གྲངས་མྱེད་པའི་ཁང་པས་མཛེས་པར་བྱས་པ་སྟེ། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེ་བཻ་ཌཱུརྱའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ།
en: That great city was beautified by high buildings that had the countless colors of precious jewels: There were countless kūṭāgāras of Jambu River gold, with an inconceivable array of jewels, covered in a network of strings of beryl jewels.

source: གྲངས་མྱེད་པ་དང་ལྡན་པའོ། །དངུལ་གྱི་ཁང་པ་བརྩེགས་པ་ལ་མུ་ཏིག་དམར་པོའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མྱི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ།
en: There were countless kūṭāgāras of silver, with an inconceivable array of jewels, covered in a network of strings of red pearls.

source: གྲངས་མྱེད་པ་དང་ལྡན་པའོ། །བཻ་ཌཱུརྱའི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེའི་མཛོད་སྣ་ཚོགས་ཀྱི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་གྲངས་མེད་པ་དང་ལྡན་པའོ། །
en: There were countless kūṭāgāras of beryl, with an inconceivable array of jewels, covered in a network of strings of a treasure of precious jewels.

source: ཤེལ་གྱི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྙིང་པོ་ཡངས་པའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱ་ན་པ་གྲངས་མེད་པ་དང་ལྡན་པའོ། །
en: There were countless kūṭāgāras of crystal, with an inconceivable array of jewels, covered in a network of strings of the kings of jewels called abundant essence.

source: ནོར་བུ་རིན་པོ་ཆེ་འགྲོ་བའི་ཡིད་དུ་འོང་བའི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེ་ཉི་མའི་སྙིང་པོའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་གྲངས་མྱེད་པ་དང་ལྡན་པའོ། །
en: There were countless kūṭāgāras of jewels that delight beings, with an inconceivable array of jewels, covered in a network of strings of the kings of jewels called sunstones.

source: རིན་པོ་ཆེ་ཨིན་དྲ་ནཱི་ལའི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེ་དཔལ་གྱི་འོད་ཟེར་གྱི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་གྲངས་མེད་པ་དང་ལྡན་པའོ།
en: There were countless kūṭāgāras of sapphires, with an inconceivable array of jewels, covered in a network of strings of the kings of jewels called light rays of splendor jewels.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་འགྲོ་བ་རྒྱ་མཚོའི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྐར་མའི་འོད་གཟེར་གྱི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་བགྲངས་མྱེད་པ་དང་ལྡན་པའོ། །
en: There were countless kūṭāgāras of the precious jewel ocean of beings, with an inconceivable array of jewels, covered in a network of strings of the kings of jewels called asterias.

source: རིན་པོ་ཆེ་རྡོ་རྗེའི་ཁང་པ་བརྩེགས་པ་ལ་རིན་པོ་ཆེའི་རྒྱལ་པོ་གཞན་གྱིས་མི་ཐུབ་པའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་གྲངས་མྱེད་པ་དང་ལྡན་པའོ།
en: There were countless kūṭāgāras of diamonds, with an inconceivable array of jewels, covered in a network of strings of the kings of jewels called invincible banners.

source: དུས་དང་འཐུན་པའི་ཙན་དན་གྱི་ཁང་པ་བརྩེགས་པ་ལ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་མནྡཱར་བས་ཀུན་ནས་ཁེབས་བ་བསམ་གྱིས་མི་ཁྱབ་པ་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་གྲངས་མེད་བ་དང་ལྡན་པའོ།
en: There were countless kūṭāgāras of yellow sandalwood, with an inconceivable array of jewels, covered in a network of divine coral tree flowers.

source: སྤོས་ཀྱི་རྒྱལ་པོ་མཚུངས་པ་མེད་པའི་ཁང་པ་བརྩེགས་པ་ལ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རིན་པོ་ཆེའི་རྒྱན་གྱིས་བརྒྱན་པ་གྲངས་མེད་པ་དང་ལྡན་པའོ། །
en: There were countless kūṭāgāras of the unequaled king of perfumes, with an inconceivable array of jewels, covered in a network of a variety of divine flowers.

source: རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་དེ་དག་རེ་རེ་ཞིང་ཡང་རིན་པོ་ཆེའི་ལན་ཀན་དུ་མས་བརྒྱན་པ། རིན་པོ་ཆེའི་སྟེགས་བུ་རིམ་པ་བདུན་གྱིས་བསྐོར་བ། རིན་པོ་ཆེའི་ཏ་ལའི་ཕྲེང་བ་རིམ་པ་བདུན་གྱིས་འཁོར་བར་འགྲིགས་པའོ། །
en: Each of those precious houses was adorned with many precious rooftop railings, was encircled by seven levels of precious balconies, and had seven rows of precious palm trees arranged around it.

source: རིན་པོ་ཆེའི་ལན་ཀན་དེ་དག་དང་། རིན་པོ་ཆེའི་དེ་ལ་དེ་དག་ཐམས་ཅད་དུ་འང་ཕན་ཚུན་རིན་པོ་ཆེའི་སྲད་བུའི་འབྲེལ་བའོ། །
en: Precious strings connected all the precious rooftop railings and the precious palm trees.

source: རིན་པོ་ཆེའི་སྲད་བུ་དེ་དག་ཐམས་ཅད་ཀྱང་གསེར་གྱི་དྲིལ་གྱི་ཕྲེང་བས་བརྒྱན་པའོ། །
en: Lines of golden bells adorned all those precious strings.

source: གསེར་གྱི་དྲིལ་གྱི་ཕྲེང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེའི་ཆུན་པོའི་ལྡ་ལྡི་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བྲེས་ཤིང་སྦྲེལ་བའོ། །རིན་པོ་ཆེའི་ཆུན་པོའི་ལྡ་ལྡི་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་མངོན་པར་སྦྱངས་པ་དག་སྟེ།
en: Hanging wreaths of flowers were fastened to all those golden bells, and a network of precious little spherical bells hung from all those wreaths of flowers.

source: དེ་ལྟར་གྲོང་ཁྱེར་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ནི་ནོར་བུ་རིན་པོ་ཆེའི་དྲ་བ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། ལྷ་རྫས་ཀྱི་སྤོས་ཀྱི་དྲ་བ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་བའོ། །ལྷ་རྫས་ཀྱི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་དྲ་བ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་བའོ། །རིན་པོ་ཆེའི་འབྲུའི་དྲ་བ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། །རྡོ་རྗེའི་བླ་རེ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། རིན་པོ་ཆེའི་བླ་རེ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། །
en: In that way, the entire great city was covered in countless networks of precious jewels, was covered in countless networks of precious bells and little spherical bells, was covered in countless networks of divine perfumes, was covered in countless networks of divine flowers, was covered in countless networks of precious spheres, was covered in countless diamond canopies, was covered in countless precious canopies, was covered in countless precious parasols, was covered in countless precious kūṭāgāra canopies, was covered in countless precious cloth canopies, and was covered in countless canopies of flower garlands.

source: རིན་པོ་ཆེའི་བླ་རེ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པའི་བླ་རེ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། །གོས་རིན་པོ་ཆེའི་བླ་རེ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ། །མེ་ཏོག་གི་ཕྲེང་བའི་བླ་རེ་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའོ།
en: Precious parasols and banners had been erected throughout the great city.

source: རིན་པོ་ཆེའི་གདུགས་དང་། རྒྱལ་མཚན་སྣ་ཚོགས་བཙུགས་ཤིང་བསྒྲེང་བ་སྟེ། གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་དེའི་དབུས་སུ། རྒྱལ་པོ་འོད་ཆེན་པོ་བཞུགས་པའི་ཕོ་བྲང་བརྩིགས་པ་འཁོར་ཀུན་ཏུ་དཔག་ཚད་བཞི་ཡོད་པ་སྟེ།
en: In the center of the great city of Suprabha was King Mahāprabha’s palace.

source: རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའོ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྟེགས་བུ་རིམ་བདུན་གྱིས་ཡོངས་སུ་བསྐོར་བའོ། །རིན་པོ་ཆེའི་དྲིལ་བུ་ཡིད་དུ་འོང་བའི་སྒྲ་སྙན་པར་འཁྲོལ་བའི་དྲ་བ་རིམ་བདུན་གྱི་སྒྲ་ཀུན་ནས་འབྱུང་བའོ། །རིན་པ་ཆེ་སྣ་བདུན་གྱི་ཏ་ལའི་འཕྲེང་བ་རིམ་པ་བདུན་གྱིས་ཀུན་ནས་བསྐོར་བའོ། །རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁང་པ་བརྩེགས་པའི་རྒྱན་བརྒྱ་སྟོང་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པའོ།
en: The palace was four yojanas wide on every side, was made of the seven precious materials, was encircled by seven levels of balconies, had seven levels of networks of precious little spherical bells that emitted a beautiful sound, was encircled by seven rows of palm trees made of the seven precious materials, and was adorned by an inconceivable hundred thousand kūṭāgāras made of various precious materials.

source: རྫིང་རིན་པོ་ཆེ་སྣ་ཚོགས་དུ་མ་ལས་བྱས་པ། གསེར་གྱི་གྲམ་པ་ཀུན་ཏུ་བཀྲམ་པ་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་ས་ཡོངས་སུ་གང་བ། ལྷ་རྫས་ཀྱི་ཨུཏ་པ་ལ་དང་། པད་མོ་དང་ཀུ་མུད་དང་མེ་ཏོག་པུན་ད་རི་ཀས་ཆུའི་སྟེང་ཀུན་ཏུ་ཡོག་པ།
en: It had pools made of a variety of precious materials, with bottoms covered in gold sand, filled with water that had the eight excellent qualities, and its surface was covered with blue lotuses, night lotuses, and white lotuses.

source: རིན་པོ་ཆེའི་མེ་ཏོག་དང་འབྲས་བུ་ཤིང་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པ།
en: They were beautified by trees that had flowers and fruits of every kind of precious material.

source: ཕྱོགས་བཞི་ནས་རིན་པོ་ཆེའི་ཕ་གུས་བརྩིགས་པའི་ཐེམ་སྐས་རྣམ་པར་བཀྱེ་བ་ཅན་གྱིས་ཤིན་ཏུ་མཛེས་པར་བྱས་པ་དང་ལྡན་པ། །
en: On all four sides there were beautiful precious railings intersected by steps.

source: ལྷ་རྫས་ཀྱི་སྒྲ་སྙན་ཅིང་ཡིད་དུ་འོང་བ་འབྱིན་པའི་བྱ་བྲན་སྣ་ཚོགས་ཀྱི་སྒྲ་ཤིན་ཏུ་འབྱུང་བ་ཡོད་པ།
en: There were the divine, sweet, and melodious songs of flocks of birds.

source: ལྷའི་དབང་པོའི་ཕོ་བྲང་དང་འགྲན་པ་སྟེ། དེའི་དབུས་ན་རིན་པོ་ཆེ་འགྲོ་བ་ལ་སྣང་བའི་ཁང་པ་བརྩེགས་པ།
en: In the center of this palace, which rivaled that of Devendra, there was a precious kūṭāgāra that shone on beings.

source: ཤིན་ཏུ་བཟང་ལ་མཛེས་ཤིང་ཡིད་དུ་འོང་བ། རིན་པོ་ཆེ་གྲངས་མེད་པའི་རྒྱན་བསམ་གྱིས་མ་ཁྱབ་པས་གྱ་ནོམ་པར་བརྒྱན་པ་ཡོད་དེ།
en: It was adorned with a splendid display of countless, beautiful jewels.

source: དེའི་ནང་ན་རྒྱལ་པོ་འོད་ཆེན་པོའི་དམ་པའི་ཆོས་གཅེས་པའི་དབྱིག་ཏུ་བྱ་བ་བཞུགས་སོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་རིན་པོ་ཆེའི་འོབས་དེ་དག་ལ་ནི་ཆགས་པའི་སེམས་མྱེད།
en: It was a treasury of the good Dharma that had been established by King Mahāprabha.

source: རིན་པོ་ཆེའི་ར་བ་དེ་དག་ལ་ནི་ངོ་མཚར་དུ་འཛིན་པའི་སེམས་མྱེད། རིན་པོ་ཆེའི་ཏ་ལའི་འཕྲེང་བ་དེ་དག་ལ་ནི་འདོད་ཅིང་ཆགས་པ་མེད། རིན་པ་ཆེའི་དྲིལ་གྱི་དྲ་བའི་སྒྲ་ལ་ནི་རོ་མྱོང་བར་བྱེད་པ་མྱེད། ལྷ་རྫས་ཀྱི་རོལ་མོའི་སྒྲ་དང་། གླུ་ང་རོ་སྙན་པའི་དབྱངས་ལ་ནི་ཆགས་པའི་སེམས་མྱེད། རིན་པོ་ཆེ་རྣམ་པ་ཐ་དད་པའི་གཞལ་མྱེད་ཁང་དང་། ཁང་པ་བརྩེགས་པ་སྣ་ཚོགས་ཀྱི་ལོངས་སྤྱོད་ནི་ཡིད་ལ་བྱ་བ་མེད་པར་ཤིན་ཏུ་དགའ་བར་གྱུར་པའི། སྐྱེས་པ་དང་བུད་མྱེད་ཀྱི་ཚོགས་ཀྱི་ཆོས་ཀྱི་དགའ་བའི་མོས་པས་ཤིན་ཏུ་དགའ་ཞིང་། གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་ལ་དགའ་བས་དབེན་པའི་སེམས་དང་ལྡན་པ།
en: Sudhana, the head merchant’s son, had no attachment toward the precious moats, he was not astonished by the precious walls, he had no craving for the rows of precious palm trees, he took no delight in the sounds from the networks of bells and little spherical bells, he had no clinging to the melodious sounds of the divine music and songs, he paid no attention to the delights of the celestial kūṭāgāras composed of various shining jewels, he found no pleasure in the pleasurable qualities of the groups of young men and women, and he was detached from the pleasures of form, sound, smell, taste, and touch.

source: ཆོས་ངེས་པར་བརྟགས་པ་ལ་ཤིན་ཏུ་མོས་པས་སེམས་ཅན་གང་དང་ཕྲད་ཀྱང་།
en: Focused on the contemplation of the Dharma, he asked whomever he met about the kalyāṇamitra.

source: དགེ་བའི་བཤེས་གཉེན་རྟག་ཏུ་འདྲི་ཞིང་མཐར་གྱིས་གྲོང་ཁྱེར་གྱི་ལམ་གྱི་སུམ་མདོའི་དྲུང་ཞིག་དུ་ཕྱིན་ནས་ཀུན་ཏུ་བལྟས་ན།
en: In that way, he eventually arrived at a place in the city where three roads met, and he looked around.

source: གྲོང་ཁྱེར་གྱི་ལམ་གྱི་སུམ་མདོའི་དབུས་ཀྱི་མཆོད་རྟེན་གྱི་ཁང་པ་ནས་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ན།
en: He saw that not far from a caitya temple in the center of the junction of the three roads was a great throne with great adornments.

source: རྒྱན་ཆེན་པོ་དང་ལྡན་པའི་ཁྲི་ཆེན་པོ་བཻ་ཌྰུཪྻ་སྔོན་པོའི་རྐང་པ་བཀྱེ་བ། བཻ་ཌྰུཪྻ་དཀར་པོའི་སེང་གེས་བླངས་པ། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ལྕགས་པོད་ཀྱི་དྲ་བ་ལེགས་པར་བཏགས་པ། ལྷ་རྫས་ལས་ཀྱང་འདས་པའི་རིན་པོ་ཆེའི་སྟན་སྣ་ཚོགས་བཏིང་བ།
en: It had legs of blue beryl, was supported by white beryl lions, was inlaid with a network of threads of Jambu River gold, and had various precious cushions, superior to divine materials, laid upon it.

source: རིན་པོ་ཆེའི་འབྲུ་གྲངས་མེད་པས་རྣམ་པར་བརྒྱན་པ། ནོར་བུ་རིན་པོ་ཆེའི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ།
en: It was adorned by countless precious disks and covered with an inconceivable network of an array of precious jewels.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་སྣམ་བུ་ལ། ལྷ་རྫས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་གུར་ཤིན་ཏུ་སྤ་བར་བཀྱེ་བའི་གནམ་ཡོལ་བྲེས་པ། ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་པད་མོའི་སྙིང་པོ་དང་ལྡན་པ།
en: Above it there was a canopy like a tent made of cloth of Jambu River gold, with a variety of divine precious materials and a central lotus made of the kings of wish-fulfilling jewels.

source: དེ་ལྟུ་བུའི་ཆོས་ཀྱི་ཁྲི་ཆེན་པོ་ལ་རྒྱལ་པོ་འོད་ཆེན་པོ་མྱི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལུས་ཤིན་ཏུ་བརྒྱན་པ་དཔེ་བྱད་བཟང་པོ་སྣ་ཚོགས་བརྒྱད་ཅུ་ཐམ་པས་ལུས་ཤིན་ཏུ་མཛེས་པ་གསེར་གྱི་རི་བོ་ལྟར་རིན་པོ་ཆེ་སྣ་ཚོགས་རྣམ་པར་བཀོད་པས་རྣམ་པར་མཛེས་པ་ཉི་མའི་དཀྱིལ་འཁོར་ལྟར་གཟི་བརྗིད་རབ་ཏུ་འབར་བ།
en: Seated cross-legged on that great Dharma throne was King Mahāprabha, whose body was adorned by the thirty-two signs of a great being. His body was beautified by the complete variety of the eighty features of a great being. He was like a mountain of gold. He was adorned with an array of various jewels. He shone magnificently like the disk of the sun.

source: ཟླ་བ་ཉ་ཞིང་རྒྱས་པའི་དཀྱིལ་འཁོར་ལྟར་ལྟ་ན་བཟང་བ།
en: He was lovely to look at like the disk of the full moon.

source: ཚངས་པ་ལྟར་ཚངས་པའི་འཁོར་གྱི་ནང་ན་རྣམ་པར་མཛེས་པ།
en: He was beautiful like Brahmā in the midst of his retinue of Brahmā devas.

source: རྒྱ་མཚོ་ལྟར་ཟབ་མོའི་ཆོས་དང་ཡོན་ཏན་མཐའ་ཡས་པའི་རིན་པོ་ཆེའི་ཚོགས་དང་ལྡན་པ།
en: He was like the ocean, possessing an accumulation of the jewels of the infinite qualities of the Dharma.

source: སྤྲིན་ཆེན་པོ་ལྟར་ཆོས་ཀྱི་རང་བཞིན་གྱི་འབྲུག་སྒྲ་སྒྲོག་པ།
en: Like a great cloud he emitted the thunder that was the nature of the Dharma.

source: ནམ་མཁའ་ལྟར་ཆོས་ཀྱི་ཚུལ་གྱི་སྐར་མའི་ཚོགས་ཀྱིས་བརྒྱན་པ།
en: Like the sky he was adorned by the stars of the ways of the Dharma.

source: རི་རབ་ལྟར་ཁ་དོག་བཞི་པོའི་སེམས་ཅན་རྒྱ་མཚོའི་སེམས་ལ་གཟུགས་བརྙན་རབ་ཏུ་སྣང་བ་རིན་པོ་ཆེའི་གླིང་ལྟར་གཞི་ཡེ་ཤེས་སྣ་ཚོགས་རིན་པོ་ཆེས་ཡོངས་སུ་གང་བ་དེ་སྐྱིལ་མོ་ཀྲུང་དུ་འདུག་པ་མཐོང་ངོ་། །
en: Like Sumeru his image appeared in the minds of the ocean of the four classes of beings. Like an island of jewels he was a ground filled with the jewels of various knowledges.

source: དེའི་མདུན་ན་ཡང་གསེར་དང་ནོར་བུ་དང་མུ་ཏིག་དང་། བཻཌཱུརྱ་དང་དུང་དང་མན་ཤེལ་དང་བྱི་རུ་དང་། ས་ལེ་སྦྲམ་དང་དངུལ་རིན་པོ་ཆེའི་ཕུང་པོ་དང་། ལྷ་རྫས་ཀྱི་གོས་ཁ་དོག་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་རྒྱན་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་དང་། ཁ་ཟས་དང་སྤྱན་གཟིགས་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་དང་། ཞིམ་པའི་མཆོག་ཁྱད་པར་དུ་འཕགས་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་དགོད་པ་དང་། དངར་བའི་ཐབས་སྣ་ཚོགས་ཀྱི་ཡུལ་དུ་བཀོད་པ་མཐོང་ངོ་། །ལྷ་རྫས་ཀྱི་ཤིང་རྟ་རིན་པོ་ཆེ་བྱེ་བ་བརྒྱ་སྟོང་དུ་མ་དང་།
en: Sudhana saw that arranged in front of King Mahāprabha there was a precious heap of gold, jewels, pearls, beryls, conch, crystal, corals, gold ornaments, and silver; a heap of divine clothing in various colors; a heap of various kinds of divine jewelry; a heap of food and various gifts; a heap of the various kinds of superior, supremely delicious flavors; and a heap of a range of all kinds of displays.

source: ལྷ་རྫས་ཀྱི་སིལ་སྙན་བྱེ་བ་བརྒྱ་སྟོང་དུ་མ་དང་། ལྷ་རྫས་ཀྱི་སྤོས་ཀྱི་རྣམ་པ་བརྒྱ་སྟོང་དུ་མ་དང་། ནད་ཀྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་ཀྱི་ཕུང་པོ་དུ་མ་དང་། ཡོ་བྱད་ཀྱི་ཁྱད་པར་ཐམས་ཅད་ཀྱི་ཕུང་པོ་སྤྱད་དུ་རུང་ཞིང་ཁ་ན་མ་ཐོ་བ་མེད་པ་མང་པོ་སེམས་ཅན་རྣམས་ཅི་དགའ་བར་སྤྱོད་དུ་གཟུད་པའི་ཕྱིར་བཤམས་ཏེ།
en: Sudhana saw many trillions of precious divine carriages, many trillions of precious divine musical instruments, many trillions of different kinds of divine perfumes, many heaps of medicine for healing sickness, and heaps of all kinds of particular utensils that were suitable, faultless, and for beings to use as they wish.

source: བཀོད་པ་དང་། བ་བཞོན་གསེར་གྱི་རུ་མྱིག་ཅན་སྟོང་ཕྲག་དུ་མ། འོ་མ་བྲེས་འཇལ་བ་མང་པོ་ཡང་སེམས་ཅན་ཕོངས་པ་རྣམས་ཡོངས་སུ་བསྡུ་བའི་ཕྱིར་བཀོད་པ་མཐོང་ངོ་།
en: Sudhana saw a hundred thousand young milk-yielding cows with golden horns and hooves set out for poor people to obtain.

source: བུ་མོ་རིན་པོ་ཆེ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་བཞིན་བཟང་བ།
en: Sudhana saw a quintillion precious maidens who had been assembled.

source: ཤིན་ཏུ་མཛེས་པ་ལྟ་ན་སྡུག་པ།
en: They were beautiful, attractive, and lovely to look at.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་ཀླུབས་པ། ལྷ་རྫས་ཀྱི་གོས་རིན་པོ་ཆེ་གྱོན་པ། ལྷ་རྫས་ཀྱི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོས་ལུས་བྱུགས་པ།
en: They were adorned in all jewelry and wore precious clothing of divine material, their bodies anointed with divine uragasāra sandalwood.

source: སྒྱུ་རྩལ་དྲུག་ཅུ་རྩ་བཞིའི་ཚུལ་ཤེས་པ། འདོད་པའི་སྤྱོད་པ་དང་། ཆོ་ག་ཐམས་ཅད་ལ་མཁས་པ་དག་ཀྱང་བསྩོགས་ཤིང་བཀོད་པར་མཐོང་ངོ་། །དེའི་མདུན་ན་ཇི་ལྟ་བ་དེ་བཞིན་དུ་སེམས་ཅན་རྣམས་ཡོངས་སུ་བསྡུ་བ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་གཟུང་བ་དང་། སེམས་ཅན་རྣམས་དགའ་བ་བསྐྱེད་པ་དང་། སེམས་ཅན་རྣམས་སྤྲོ་བ་བསྐྱེད་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ཡིད་དང་བར་བྱ་བ་དང་།
en: They had mastered the sixty-four skills and were expert in all the arts of lovemaking.

source: སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཤིན་ཏུ་བདེ་བར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་རྣམ་པར་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་ཆོས་ཀྱི་རང་བཞིན་གྱི་དོན་ལ་ཡོངས་སུ་དགོད་པ་དང་། སེམས་ཅན་རྣམས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དོན་མཉམ་པར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་གཞན་ལ་འཁུ་བ་རྣམ་པར་བཟློག་པར་བྱ་བ་དང་། ལུས་དང་ངག་གིས་ངན་དུ་སྤྱོད་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ལྟ་བའི་ཟུག་རྔུ་ཡང་དག་པར་དབྱུང་བ་དང་།
en: Sudhana saw all these requisites gathered and arranged in front of the king for beings to collect, for beings to take, to bring happiness to beings, to bring joy to beings, to bring peace of mind to beings, to bring delight to beings, to cause the kleśas to cease within beings, to lead beings to the meaning of the nature of all phenomena, to direct beings to the meaning that is the same as omniscience, to turn beings away from ill will toward others, to turn beings away from bad physical and vocal actions, to extract the splinter of false views from beings, and for beings to purify their path of action.

source: སེམས་ཅན་རྣམས་ཀྱི་ལམ་ཡོངས་སུ་སྦྱང་བའི་ཕྱིར། སྲང་དང་ལམ་གྱི་བཞི་མདོ་དང་། ལམ་གྱི་སུམ་མདོ་དང་། སྒོ་དང་ཁྱམས་དག་ནའང་དེ་བཞིན་ཏེ། སྲང་རེ་རེའི་ངོས་གཡས་གཡོན་ནས་ཀྱང་སྟེགས་བུ་བྱེ་བ་ཉི་ཤུ་ཉི་ཤུ་ཙམ་ལ་ཡོ་བྱད་ཐམས་ཅད་ཡོངས་སུ་སྤུངས་ཏེ་བཀོད་པ་མཐོང་ངོ་། །
en: They were piled up and presented on two hundred million platforms at every crossroads of four streets, at every junction of three streets, and in front of the rows of doors and courtyards on both sides of every street.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་རྒྱལ་པོ་འོད་ཆེན་པོ་ལ་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་ནས་ཕྱག་བྱས་ཏེ། རྒྱལ་པོ་འོད་ཆེན་པོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ།
en: Sudhana, the head merchant’s son, prostrated his whole body onto the ground in homage to King Mahāprabha, and he circumambulated King Mahāprabha, keeping him to his right, many hundreds of thousands of times.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He then sat down before him, placed the palms of his hands together, and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ། སྨྲས་པ།
en: Therefore, Ārya, teach me how bodhisattvas train in bodhisattva conduct and in what way they practice it!”

source: རིགས་ཀྱི་བུ་ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བྱམས་པ་ཆེན་པོའི་རྒྱལ་མཚན་ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་སྟེ།
en: King Mahāprabha said, “Noble one, I have purified and perfected the bodhisattva conduct called the banner of great love.

source: རིགས་ཀྱི་བུ་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བྱམས་པ་ཆེན་པོའི་རྒྱལ་མཚན་འདི་ཡང་སངས་རྒྱས་བརྒྱ་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་སྟོང་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ནས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་ཡོངས་སུ་དྲིས་སོ། ཡོངས་སུ་ཞུས་སོ།
en: “Noble one, I addressed questions about this bodhisattva conduct called the banner of great love to many hundreds of buddhas, many thousands of buddhas, many hundreds of thousands of buddhas, many quintillions of buddhas, and so on up to an innumerable number of innumerable numbers of buddha bhagavats.
